samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/enet_io.c
    if(iSeqIdx < 0 || iDataIdx < 0)
    {
        return(DEFAULT_CGI_RESPONSE);
    }

    iSeqNum = (int32_t)ustrtoul(pcValue[iSeqIdx], NULL, 10);
    bLast   = (iLastIdx >= 0) && (pcValue[iLastIdx][0] == '1');
    pcData  = pcValue[iDataIdx];
    ui32DataHexLen = ustrlen(pcData) & ~1u; // must be even (pairs of hex chars)

    //
    // First chunk: reset state and pre-erase the header and first image page.
    //
    if(iSeqNum == 0)
    {
        g_ui32OTAWriteAddr    = OTA_IMAGE_ADDR;
        g_ui32OTASize         = 0;
        g_ui32OTAAlignLen     = 0;
        g_ui32OTALastErasedPage = OTA_IMAGE_ADDR;
        g_bOTAAbort           = false;
        g_i32OTANextSeq       = 0;

        MAP_FlashErase(OTA_HEADER_ADDR);
        MAP_FlashErase(OTA_IMAGE_ADDR);

        UARTprintf("OTA: upload started.\n");
    }

    //
    // Once a chunk has overflowed the staging region (or otherwise failed),
    // ignore every further chunk until a fresh seq==0 restarts the upload.
    //
    if(g_bOTAAbort)
    {
        return("/tools.shtml");
    }

    //
    // Ordering / idempotency guard, so a dropped connection can be safely retried
    // by the client resending the SAME chunk.  Each seq is applied exactly once,
    // in order:
    //   seq <  next -> already applied (a retry whose response was lost) -> ACK
    //                  without re-writing, keeping the byte stream intact.
    //   seq >  next -> a chunk was missed -> abort; the client restarts at seq 0.
    //   seq == next -> apply it below, then advance g_i32OTANextSeq.
    //
    if(iSeqNum < g_i32OTANextSeq)
    {
        return(bLast ? "/fwupdate_ok.shtml" : "/tools.shtml");
    }
    if(iSeqNum > g_i32OTANextSeq)
    {
        g_bOTAAbort = true;
        UARTprintf("OTA: out-of-order chunk (got %d, want %d), aborting.\n",
                   iSeqNum, g_i32OTANextSeq);
        return("/tools.shtml");
    }

    //
    // Decode hex bytes and write to staging flash in 4-byte aligned words.
    //
    for(i = 0; i < ui32DataHexLen; i += 2)
    {
        g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] =
            (uint8_t)((HexNibble(pcData[i]) << 4) | HexNibble(pcData[i + 1]));
        g_ui32OTASize++;

        if(g_ui32OTAAlignLen == 4)
        {
            //
            // Never write past the end of the staging region.  A too-large image
            // (or a buggy/hostile client) would otherwise erase and program past
            // the OTA image slot into invalid flash.  Abort and block the commit.
            //
            if(g_ui32OTAWriteAddr >= OTA_IMAGE_ADDR + OTA_IMAGE_MAX_SIZE)
            {
                g_bOTAAbort       = true;
                g_ui32OTAAlignLen = 0;
                UARTprintf("OTA: image exceeds %u-byte staging region, aborting.\n",
                           (unsigned)OTA_IMAGE_MAX_SIZE);
                break;
            }

            //
            // Erase the next 16 KB page when the write pointer first enters it.
            //
            ui32PageAddr = g_ui32OTAWriteAddr & ~(0x4000u - 1u);
            if(ui32PageAddr > g_ui32OTALastErasedPage)
            {
                MAP_FlashErase(ui32PageAddr);
                g_ui32OTALastErasedPage = ui32PageAddr;
            }

            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }
    }

    //
    // Chunk fully applied — advance so a resend of this same seq is treated as a
    // duplicate ACK (idempotent retry) and the next seq is the one expected.
    //
    if(!g_bOTAAbort)
    {
        g_i32OTANextSeq++;
    }

    //
    // Last chunk: flush any partial word (pad with 0xFF), then finalise.
    //
    if(bLast)
    {
        int32_t  iTotLenIdx, iTotCrcIdx;
        uint32_t ui32TotLen, ui32TotCrc;

        //
        // If any chunk overflowed the staging region, never commit: no header is
        // written and no pending flag is set, so the next boot keeps the current
        // firmware.
        //
        if(g_bOTAAbort)
        {
            UARTprintf("OTA: upload aborted, not committing.\n");
            return("/tools.shtml");
        }

        if(g_ui32OTAAlignLen > 0)
        {
            while(g_ui32OTAAlignLen < 4)
            {
                g_ui8OTAAlignBuf[g_ui32OTAAlignLen++] = 0xFF;
            }
            MAP_FlashProgram((uint32_t *)(uintptr_t)g_ui8OTAAlignBuf,
                             g_ui32OTAWriteAddr, 4);
            g_ui32OTAWriteAddr += 4;
            g_ui32OTAAlignLen   = 0;
        }

        //
        // End-to-end integrity check.  The client sends the total byte count and
        // CRC32 of the ORIGINAL file (totlen/totcrc).  A truncated, reordered or
        // corrupted upload will not match, so it is rejected BEFORE the image is
        // committed.  Without this the header CRC is only computed over whatever
        // bytes happened to arrive, so a short upload looks self-consistent.
        //
        iTotLenIdx = FindCGIParameter("totlen", pcParam, i32NumParams);
        iTotCrcIdx = FindCGIParameter("totcrc", pcParam, i32NumParams);
        if(iTotLenIdx < 0 || iTotCrcIdx < 0)
        {
            UARTprintf("OTA: missing totlen/totcrc, rejecting.\n");
            return("/tools.shtml");
        }
        ui32TotLen = (uint32_t)ustrtoul(pcValue[iTotLenIdx], NULL, 10);
        ui32TotCrc = (uint32_t)ustrtoul(pcValue[iTotCrcIdx], NULL, 16);

        //
        // CRC32 the staged image (over exactly the received byte count).
        //
        ui32Crc = ConfigCRC32((const uint8_t *)OTA_IMAGE_ADDR, g_ui32OTASize);

        if((g_ui32OTASize != ui32TotLen) || (ui32Crc != ui32TotCrc))
        {
            UARTprintf("OTA: integrity check failed "
                       "(len %u/%u, crc 0x%08x/0x%08x), rejecting.\n",
                       g_ui32OTASize, ui32TotLen, ui32Crc, ui32TotCrc);
            return("/tools.shtml");
        }

        //
        // Verified.  Write the header to 0x80000 and arm the pending flag.
        //
        sHdr.ui32Magic = OTA_HDR_MAGIC;
        sHdr.ui32Size  = g_ui32OTASize;
        sHdr.ui32CRC32 = ui32Crc;
        sHdr.ui32Rsvd  = 0;
        MAP_FlashProgram((uint32_t *)(uintptr_t)&sHdr,
                         OTA_HEADER_ADDR, sizeof(tOTAHeader));

        //
        // Set EEPROM pending flag so the next boot applies the update.
        //
        OtaSetPending(g_ui32OTASize);

